Revit 2024 API
ColorWithTransparency Class
 Color with transparency
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public class ColorWithTransparency : IDisposable
Visual Basic
Public Class ColorWithTransparency _
	Implements IDisposable
Visual C++
public ref class ColorWithTransparency : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ColorWithTransparency
See Also
ColorWithTransparency Members
Autodesk.Revit.DB Namespace